#+title: Lab1
#+PROPERTY: header-args :results drawer

Welcome to Lab1 of *Leveraging Kubernetes for Drupal: A Beginner's Laboratory*

The goal is to set up a fully functional Drupal site using a Kubernetes cluster on your computer. Ideally using Linux.
With a local Kubernetes cluster you will be able to test and develop, mimicking a production cluster.

This guide assumes you have Docker installed on your Linux system.
If not, please install it first from https://docs.docker.com/engine/install/ or using your distribution packages.

Each major action is broken down into steps, with each step containing the necessary commands and explanations.

** Step 1: Install k3d
   :PROPERTIES:
   :CUSTOM_ID: install-k3d
   :END:

   There are several tools that facilitate creating a local Kubernetes cluster, like k3d, kind or minikube.
   In Lab 1 we use k3d, while in Lab 2, we go over the other two.

   1. Download and install the latest version of k3d.
      #+BEGIN_SRC bash
      wget -q -O - https://raw.githubusercontent.com/rancher/k3d/main/install.sh | bash
      #+END_SRC
   2. Verify the installation.
      #+BEGIN_SRC shell
      k3d version
      #+END_SRC

      #+RESULTS:
      :results:
      k3d version v5.7.4
      k3s version v1.30.4-k3s1 (default)
      :end:


** Step 3: Install Helm
   :PROPERTIES:
   :CUSTOM_ID: install-helm
   :END:
   1. Download and install Helm.
      #+BEGIN_SRC bash
      curl https://raw.githubusercontent.com/helm/helm/master/scripts/get-helm-3 | bash
      #+END_SRC
   2. Verify Helm installation.
      #+BEGIN_SRC bash
      helm version
      #+END_SRC

      #+RESULTS:
      :results:
      version.BuildInfo{Version:"v3.16.1", GitCommit:"5a5449dc42be07001fd5771d56429132984ab3ab", GitTreeState:"clean", GoVersion:"go1.22.7"}
      :end:

** Step 4: Add Bitnami Helm Chart Repository
   :PROPERTIES:
   :CUSTOM_ID: add-bitnami-repo
   :END:

   For our installation we will use helm charts from an opensource repository.
   Helm charts are yaml files that declare/define what the application will need to run.

   1. Add the Bitnami repository.
      #+BEGIN_SRC bash
      helm repo add bitnami https://charts.bitnami.com/bitnami
      #+END_SRC

      #+RESULTS:
      :results:
      "bitnami" already exists with the same configuration, skipping
      :end:

   2. Update Helm repository.
      #+BEGIN_SRC bash
      helm repo update
      #+END_SRC

      #+RESULTS:
      :results:
      Hang tight while we grab the latest from your chart repositories...
      ...Successfully got an update from the "nfs-subdir-external-provisioner" chart repository
      ...Successfully got an update from the "longhorn" chart repository
      ...Successfully got an update from the "bitnami" chart repository
      Update Complete. ⎈Happy Helming!⎈
      :end:

      NOTE: repositories are cached locally at $HOME/.cache/helm/ and configs in $HOME/.config/helm/. Check 'helm env'

** Step 7: Access Your Drupal Site
   :PROPERTIES:
   :CUSTOM_ID: access-drupal
   :END:

   1. Get your Drupal login credentials by running:
      #+BEGIN_SRC bash
      echo Username: user
      echo Password: $(kubectl get secret --namespace default my-drupal -o jsonpath="{.data.drupal-password}" | base64 -d)
      #+END_SRC

      #+RESULTS:
      :results:
      Username: user
      Password: UjyJJILlqd
      :end:

   2. Find the Drupal pod name and Forward port 8080 to the Drupal pod.
      #+BEGIN_SRC bash
      DPOD=$(kubectl get pods --namespace default -l "app.kubernetes.io/name=drupal" -o jsonpath="{.items[0].metadata.name}")
      kubectl port-forward --namespace default --address 127.0.0.1 $DPOD 8080:8080
      #+END_SRC

   3. Access Drupal site at http://localhost:8080.

** Ensure Pods are Running and Ready
   #+BEGIN_SRC bash
   kubectl get pods
   #+END_SRC

   #+RESULTS:
   :results:
   NAME                         READY   STATUS    RESTARTS   AGE
   my-drupal-84766b946f-m4pcd   1/1     Running   0          37m
   my-drupal-mariadb-0          1/1     Running   0          37m
   :end:

